# Tap's
"threedotslabs/tap"

# Brew's

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"
brew "nushell"
brew "starship"
brew "carapace"
brew "git"
brew "go"
brew "python"
brew "azure-cli"
brew "jq"
brew "mas"
brew "nvm"
brew "jj"
brew "gpg"
brew "tree"
brew "threedotslabs/tap/tdl"

# Cask's

cask "arc"
cask "docker-desktop"
cask "ghostty"
cask "notion"
cask "postman"
cask "rectangle"
cask "tableplus"
cask "jetbrains-toolbox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "visual-studio-code"
cask "git-credential-manager"
cask "logi-options+"
cask "zulu"
cask "steam"
cask "raycast"
cask "linear-linear"
cask "iina"
cask "monitorcontrol"
cask "alt-tab"
cask "affinity"
cask "archi"
cask "lulu"
cask "aldente"
cask "syncthing-app"
cask "keyboardcleantool"
cask "discord"
cask "gramps"
cask "tailscale-app"
cask "antigravity"
cask "onlyoffice"

# MAC Store Apps

mas "HP", id: 1474276998
mas "Notion Web Clipper", id: 1559269364
mas "WhatsApp Messenger", id: 310633997
mas "Pandan", id: 1569600264
mas "Pastel", id: 413897608

# VSCode plugins

vscode "42crunch.vscode-openapi"
vscode "akamud.vscode-theme-onedark"
vscode "atommaterial.a-file-icon-vscode"
vscode "batisteo.vscode-django"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "erikphansen.vscode-toggle-column-selection"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "juliabay.spellcheck"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "maracko.json-to-go"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-regolint"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sidthesloth.html5-boilerplate"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "tsandall.opa"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"