# Taps

tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "weaveworks/tap"

# Brew's

brew "python@3.10"
brew "python-tk@3.10"
brew "ansible", link: false
brew "python@3.9"
brew "python-tk@3.9"
brew "awscli"
brew "azure-cli"
brew "glib"
brew "ctop"
brew "cql"
brew "curl"
brew "dos2unix"
brew "gh"
brew "git"
brew "gitversion"
brew "go"
brew "openjdk"
brew "groovysdk"
brew "helm"
brew "htop"
brew "hugo"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "maven"
brew "mockery"
brew "nghttp2"
brew "nmap"
brew "node"
brew "opa"
brew "putty"
brew "sl"
brew "sonar-scanner"
brew "thefuck"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hudochenkov/sshpass/sshpass"

# Cask's

cask "adoptopenjdk"
cask "apache-directory-studio"
cask "azure-data-studio"
cask "docker"
cask "font-fantasque-sans-mono"
cask "font-jetbrains-mono"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "keystore-explorer"
cask "lens"
cask "mysql-shell"
cask "mysqlworkbench"
cask "notion"
cask "postman"
cask "powershell"
cask "remote-desktop-manager"
cask "stats"
cask "tableplus"
cask "visual-studio-code"
cask "firefox"
cask "rectangle"
cask "alt-tab"

# Mac Apps

mas "Amphetamine", id: 937984704
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "Slack for Desktop", id: 803453959
mas "WhatsApp Desktop", id: 1147396723
mas "HP Smart", id: 1474276998
mas "Termius", id: 1176074088
mas "Grammarly for Safari", id: 1462114288
mas "Color Picker", id: 1545870783
