# Tap's

tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "weaveworks/tap"

# Brew's

brew "python"
brew "ansible"
brew "azure-cli"
brew "glib"
brew "cql"
brew "ctop"
brew "libidn2"
brew "curl"
brew "dos2unix"
brew "dotnet"
brew "git"
brew "gitversion"
brew "go"
brew "openjdk"
brew "helm"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "maven"
brew "nmap"
brew "node"
brew "opa"
brew "sl"
brew "sonar-scanner"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hudochenkov/sshpass/sshpass"
brew "romkatv/powerlevel10k/powerlevel10k"

# Cask's

# cask "alt-tab"
cask "anki"
cask "docker"
cask "firefox"
cask "font-fantasque-sans-mono"
cask "font-jetbrains-mono"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "keystore-explorer"
cask "mysql-shell"
cask "mysqlworkbench"
cask "notion"
cask "postman"
cask "powershell"
cask "raspberry-pi-imager"
cask "rectangle"
cask "remote-desktop-manager"
cask "stats"
cask "tableplus"
cask "visual-studio-code"
cask "vnc-viewer"

# MAC Store Apps

mas "Amphetamine", id: 937984704
mas "Color Picker", id: 1545870783
mas "Disk Speed Test", id: 425264550
mas "Grammarly for Safari", id: 1462114288
mas "HP Smart", id: 1474276998
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Mimeo Photos", id: 1282504627
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "Termius", id: 1176074088
mas "WhatsApp", id: 1147396723

# VSCode Extensions

vscode "42Crunch.vscode-openapi"
vscode "batisteo.vscode-django"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.jshint"
vscode "dbaeumer.vscode-eslint"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "erikphansen.vscode-toggle-column-selection"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "golang.go"
vscode "JuliaBay.spellcheck"
vscode "KevinRose.vsc-python-indent"
vscode "magicstack.MagicPython"
vscode "maracko.json-to-go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.anaconda-extension-pack"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.powershell"
vscode "ms-vsts.team"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "plex.vscode-regolint"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "sidthesloth.html5-boilerplate"
vscode "skip1.go-swagger"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tht13.python"
vscode "tsandall.opa"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
